{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "dtype": "float16",
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "intermediate_size": 8960,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 131072,
  "max_window_layers": 28,
  "model_type": "qwen2",
  "num_attention_heads": 12,
  "num_hidden_layers": 28,
  "num_key_value_heads": 2,
  "pad_token_id": 151643,
  "quantization_config": {
    "bits": 4,
    "checkpoint_format": "gptq",
    "desc_act": false,
    "format": "gptq",
    "group_size": 128,
    "lm_head": false,
    "meta": {
      "act_group_aware": true,
      "auto_forward_data_parallel": true,
      "damp_auto_increment": 0.01,
      "damp_percent": 0.05,
      "dense_vram_strategy": "exclusive",
      "dense_vram_strategy_devices": null,
      "fallback": {
        "smooth": null,
        "strategy": "rtn",
        "threshold": "0.5%"
      },
      "foem": null,
      "gc_mode": "interval",
      "gptaq": null,
      "hessian": {
        "chunk_bytes": null,
        "chunk_size": null,
        "staging_dtype": "float32"
      },
      "mock_quantization": false,
      "moe_vram_strategy": "exclusive",
      "moe_vram_strategy_devices": null,
      "mse": 0.0,
      "offload_to_disk": true,
      "offload_to_disk_path": "/tmp/gptqmodel_j2v5thpd",
      "pack_impl": "cpu",
      "quantizer": [
        "gptqmodel:7.0.0"
      ],
      "static_groups": false,
      "true_sequential": true,
      "uri": "https://github.com/modelcloud/gptqmodel",
      "wait_for_submodule_finalizers": false
    },
    "method": "gptq",
    "pack_dtype": "int32",
    "quant_method": "gptq",
    "sym": true
  },
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "rope_theta": 1000000.0,
    "rope_type": "default"
  },
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "5.4.0",
  "use_cache": true,
  "use_mrope": false,
  "use_sliding_window": false,
  "vocab_size": 151936,
  "torch_dtype": "float16"
}